// STEP1 요구사항

// TODO LIST 메뉴추가
// - [] 에스프레소 메뉴에 새로운 메뉴가 확인 버튼을 클릭시 추가된다.
// - [] 에스프레소 메뉴에 새로운 메뉴가 엔터키 입력으로 추가된다.
// - [] 메뉴추가 한 후 input은 빈 값으로 초기화된다.
// - [] 사용자 입력값이 빈 값이라면 추가되지 않는다.
// - [] 추가되는 메뉴의 마크업은 <ul id="espresso-menu-list" class="mt-3 pl-0"></ul> 안에 삽입해야 한다.


// TODO LIST 메뉴수정
// - [] 수정 버튼 클릭이벤트를 받아 클릭이벤트가 발생한 가장 가까운 li 태그값이 바뀐다.
// - [] 수정 버튼 클릭시 브라우저에서 제공하는 propmt 인터페이스 모달창이 띄워진다.
// - [] 메뉴 수정시 브라우저에서 제공하는 confirm 인터페이스를 활용한다.

// TODO LIST 메뉴삭제
// - [] 메뉴 삭제 버튼을 클릭시, 클릭이벤트가 발생한 가장 가까운 li 태그가 삭제된다.

// TODO LIST 총 갯수 출력
//  총 메뉴 갯수를 li태그갯수를 count하여 상단에 보여준다.
